HEADER_TO_WIDTHS = {
            "题号": 6,
            "日期": 10,
            "难度": 8,
            "耗时": 8,
            "次数": 6,
            "类型": 12,
            "推荐理由": 15,
            "链接": 40,
            "分类": 20, 
            # "分数": 
            "状态": 15,
            "平均耗时": 12,
            "最旧题目日期": 14,
            "题目数量": 10,
            "综合得分": 10
        }
HEADER_TO_ROW_WIDTHS = {
            "题号": 10,
            "日期": 12,
            "难度": 12,
            "耗时": 12,
            "次数": 12,
            "类型": 12,
            "推荐理由": 15,
            "链接": 48,
            "分类": 22,
            "状态": 17,
            "平均耗时": 16,
            "最旧题目日期": 20,
            "题目数量": 14,
            "综合得分": 14,
        }